request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="https://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getProductRequest>
            <gs:product>Coffee</gs:product>
        </gs:getProductRequest>
    </soapenv:Body>
</soapenv:Envelope>